src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Специалист</name>
    <comment>При установленном флаге для расчета ЗП берется Минимальный ОКЛАД + Прочент от объема выполненных работ</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Область ОбработчикиСобытий
#Если НаСервере Тогда

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// Если на дату документа специалисту не установлен процент оплаты от работ, 
	//то документ не должен проводится. Необходимо учитывать, что может быть установлен 
	//нулевой процент, в этом случае документ должен проводится.
	
	Сотрудник = Специалист; // Ссылка.Специалист;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Специалист КАК Специалист
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.ПроцентОтРабот = Null Тогда
			СообщениеОСотруднике = Новый СообщениеПользователю;
			ТектсОСотр = СтрШаблон("У '%1', не установлен 'Процент от работ' в РС 'Условия оплаты сотрудников'", Сотрудник);
			СообщениеОСотруднике.Текст = ТектсОСотр;
			СообщениеОСотруднике.Сообщить();
			Отказ = Истина;
		КонецЕсли;                          
		Если НЕ Выборка.Специалист ИЛИ Выборка.Специалист = Null Тогда
			СообщениеОСотруднике = Новый СообщениеПользователю;
			ТектсОСотр = СтрШаблон("Сотрудник '%1', не является 'Специалистом' в РС 'Условия оплаты сотрудников'", Сотрудник);
			СообщениеОСотруднике.Текст = ТектсОСотр;
			СообщениеОСотруднике.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	Иначе
		СообщениеОСотруднике = Новый СообщениеПользователю;
		ТектсОСотр = СтрШаблон("У '%1', не найденно данных на дату документа в РС 'Условия оплаты сотрудников'", Сотрудник);
		СообщениеОСотруднике.Текст = ТектсОСотр;
		СообщениеОСотруднике.Сообщить(); 
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		ПроцентОтРабот = Выборка.ПроцентОтРабот;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту), 0) КАК ЧасыКОплатеКлиенту,
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка
		|ПОМЕСТИТЬ ВТ_КоличествоЧасовКОплате
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КоличествоЧасовКОплате.ЧасыКОплатеКлиенту,
		|	ЕСТЬNULL(ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СоимостьЧасаРабот, 0) КАК ДоговорВКМ_СоимостьЧасаРабот
		|ИЗ
		|	ВТ_КоличествоЧасовКОплате КАК ВТ_КоличествоЧасовКОплате,
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			КоличествоЧасов = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту;
			СоимостьЧасаРабот = ВыборкаДетальныеЗаписи.ДоговорВКМ_СоимостьЧасаРабот;
			СуммаКОплате = КоличествоЧасов * СоимостьЧасаРабот;
			
			Если СуммаКОплате <> 0 Тогда
				// регистр ВКМ_ВыполненныеКлиентуРаботы
				Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
				Движение.Период = Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Клиент = Клиент;
				Движение.Договор = Договор;
				Движение.КоличествоЧасов = КоличествоЧасов;
				Движение.СуммаКОплате = СуммаКОплате;
				
				// регистр ВКМ_ВыполненныеКлиентуРаботы 
				//СуммаКОплате рассчитывается по формуе:
				//ЧасовКОплатеКлиенту * СтавкаЧасаКлиента * ПроцентОтРабот / 100
				Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
				Движение.Период = ДатаПроведенияРабот;
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Сотрудник = Сотрудник;
				Движение.ЧасовКОплате = КоличествоЧасов;
				СуммаКОплатеСпециалисту = КоличествоЧасов * СоимостьЧасаРабот * ПроцентОтРабот / 100;
				Движение.СуммаКОплате = СуммаКОплатеСпециалисту;
			КонецЕсли;
		КонецЕсли;       
		
	КонецЕсли;
КонецПроцедуры

	#КонецЕсли	
#КонецОбласти
